Tekla.Structures.Forming.DeformingType
Enumeration for deforming type.

Tekla.Structures.Forming.DeformingType.NOT_SPECIFIED
Not specified, default value.

Tekla.Structures.Forming.DeformingType.DEFORMED
Indiactes deformed item.

Tekla.Structures.Forming.DeformingType.UNDEFORMED
Indicates undeformed item.